XpaDemo/Temp/soap_request_01.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:greetMe xmlns:m="http://apache.org/hello_world_soap_http/types">
			<m:requestType>Andreas</m:requestType>
		</m:greetMe>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
